#pragma once

#include "ps2_prefix.h"

#include "eetypes.h"
#include "eestruct.h"

#include <shinobi.h>

#define NULL 0

#define CheckCmdReq(vol, pan, pitch) (0x00 | 0 | ((vol) & 1) | (((pan) & 1) << 1) | (((pitch) & 1) << 2))

typedef struct ADV_MESSAGE_DEFINITION {
    float Sx; // Start X
    float Sy; // Start Y
    int StartMsgNo; // Start Message Number
    int NaviMsgNo; // Navigation Message Number
    int MsgType; // Message Type
} ADV_MESSAGE_DEFINITION; // 0x14 bytes

typedef struct NJS_POINT4 {
    float x; // X coordinate or plane parameter
    float y; // Y coordinate or plane parameter
    float z; // Z coordinate or plane parameter
    float w; // W coordinate or plane parameter, possibly used for homogeneous clipping
} NJS_POINT4; // 16 bytes (0x10)

typedef struct SND_QUEUE {
    int cmd; // Command
    char vol; // Volume
    char pan; // Pan
    short pitch; // Pitch
} SND_QUEUE; // 0x8 bytes

typedef struct SND_STATUS {
    unsigned short se_info[6]; // Sound effect information
    unsigned short midi_info; // MIDI information
    short port_info[8]; // Port information
    short midi_sum[4]; // MIDI summary
    short se_sum[5]; // Sound effect summary
    unsigned short dummy[9]; // Reserved for alignment or future use
} SND_STATUS;

typedef struct Unknown29 {
    char ppStrPvpl[4]; // "PVPL"
    unsigned int ppNextTag; // Next Tag
    unsigned short ppCategoryCode; // Category Code
    unsigned short ppBankId; // Bank ID
    unsigned short ppEntryOffset; // Entry Offset
    unsigned short ppEntryCount; // Entry Count
} Unknown29; // 0x10 bytes

typedef struct PS2_TIM_LIST_ENTRY_ADMIN {
    unsigned int gindex; // G-Index
    unsigned int size; // Size
    unsigned int count; // Count
    void* addr; // Address
    void* before; // Before
    void* after; // After
} PS2_TIM_LIST_ENTRY_ADMIN; // 0x18 bytes

typedef struct PS2_TIM_LIST_ENTRY {
    char FileId[4]; // File ID
    unsigned char FormatVersion; // Format Version
    unsigned char FormatId; // Format ID
    unsigned short Pictures; // Pictures
    unsigned int Gindex; // G-Index
    unsigned char OrgColorType; // Original Color Type
    unsigned char OrgTexType; // Original Texture Type
    unsigned short ClutChange; // CLUT Change
    unsigned int PalNum; // Palette Number
    unsigned int PalData[27]; // Palette Data
    unsigned int TotalSize; // Total size
    unsigned int ClutSize; // CLUT size
    unsigned int ImageSize; // Image size
    unsigned short HeaderSize; // Header size
    unsigned short ClutColors; // CLUT colors
    unsigned char PictFormat; // Picture format
    unsigned char MipMapTextures; // MipMap textures
    unsigned char ClutType; // CLUT type
    unsigned char ImageType; // Image type
    unsigned short ImageWidth; // Image width
    unsigned short ImageHeight; // Image height
    sceGsTex0 GsTex0; // GS Texture 0
    sceGsTex1 GsTex1; // GS Texture 1
    unsigned int GsRegs; // GS Registers
    unsigned int GsTexClut; // GS Texture CLUT
    PS2_TIM_LIST_ENTRY_ADMIN admin; // Admin
    unsigned int TpFlag; // TP Flag
    unsigned int ClampFlag; // Clamp Flag
} PS2_TIM_LIST_ENTRY;

typedef struct TIM2_PICTUREHEADER {
    unsigned int TotalSize; // Total Size
    unsigned int ClutSize; // CLUT Size
    unsigned int ImageSize; // Image Size
    unsigned short HeaderSize; // Header Size
    unsigned short ClutColors; // CLUT Colors
    unsigned char PictFormat; // Picture Format
    unsigned char MipMapTextures; // MipMap Textures
    unsigned char ClutType; // CLUT Type
    unsigned char ImageType; // Image Type
    unsigned short ImageWidth; // Image Width
    unsigned short ImageHeight; // Image Height
    unsigned long GsTex0; // GS Texture 0
    unsigned long GsTex1; // GS Texture 1
    unsigned int GsRegs; // GS Registers
    unsigned int GsTexClut; // GS Texture CLUT
} TIM2_PICTUREHEADER;

typedef struct ADV_WORK {
    int PatId; // Pattern ID
    int Mode; // Mode
    int Mode2; // Mode 2
    int NextMode; // Next Mode
    int NextReturnCode; // Next Return Code
    int PortId; // Port ID
    int OptIndex; // Option Index
    int OptLevel; // Option Level
    int NextOptLevel; // Next Option Level
    int OptScrX; // Option Screen X
    int OptScrY; // Option Screen Y
    unsigned int PalNo; // Palette Number
    unsigned int PalMode; // Palette Mode
    unsigned int FontBaseColor; // Font Base Color
    unsigned char* SysMemPtr; // System Memory Pointer
    unsigned char* MsgPtr; // Message Pointer
    unsigned char* ptr[8]; // Pointers
    float Timer; // Timer
    float FadeRate; // Fade Rate
    float FadeSpeed; // Fade Speed
    float SaverTimer; // Saver Timer
    float SaverRate; // Saver Rate
    float FlushCount; // Flush Count
    float FlushSpeed; // Flush Speed
    float FlushCount2; // Flush Count 2
    float FlushSpeed2; // Flush Speed 2
    float ScrollPlatePosX[2][2]; // Scroll Plate Position X
    char Active; // Active
    char AppMode; // Application Mode
    char ExtraFlag; // Extra Flag
    char FadeType; // Fade Type
    char SaverCommand; // Saver Command
    char Count; // Count
    char LastLevel; // Last Level
    char FromTitle; // From Title
    char CurrentDiscId; // Current Disc ID
    char NextDiscId; // Next Disc ID
    char ErrorId; // Error ID
    unsigned char ErrorMsgFlushCount; // Error Message Flush Count
    char AnimId; // Animation ID
    unsigned char AnimTime; // Animation Time
    char GenFlag; // General Flag
    char PalFlag; // Palette Flag
    char SrFlag; // SR Flag
    char OptFadeType; // Option Fade Type
    char TexFlag; // Texture Flag
    char SoundMode; // Sound Mode
    char vibration; // Vibration
    char keytype; // Key Type
    char adjust_x; // Adjust X
    char adjust_y; // Adjust Y
    char OptSaveFlag; // Option Save Flag
    char vMode; // V-Mode
    char DriveNo; // Drive Number
    char MsgNo; // Message Number
    char DepthLevel; // Depth Level
    char OldVmOpMode; // Old VM Operation Mode
    char VmOpMode; // VM Operation Mode
    char SetTexture[2]; // Set Texture
    char KeyCommandCount[7]; // Key Command Count
    char Cursor[3]; // Cursor
    char CursorMax[3]; // Cursor Max
    char CursorFlag[4][4]; // Cursor Flag
    char ModeCommandId[4]; // Mode Command ID
} ADV_WORK;

typedef struct Camera {
    /*   0 */ unsigned int flg; // Flags
    /*   4 */ int camver; // Camera Version
    /*   8 */ unsigned char mode0; // Mode 0
    /*   9 */ unsigned char mode1; // Mode 1
    /*  10 */ unsigned char mode2; // Mode 2
    /*  11 */ unsigned char mode3; // Mode 3
    /*  12 */ float px; // Position X
    /*  16 */ float py; // Position Y
    /*  20 */ float pz; // Position Z
    /*  24 */ float vx; // Vector X
    /*  28 */ float vy; // Vector Y
    /*  32 */ float vz; // Vector Z
    /*  36 */ float wpx; // World Position X
    /*  40 */ float wpy; // World Position Y
    /*  44 */ float wpz; // World Position Z
    /*  48 */ float plx; // Player X?
    /*  52 */ float ply; // Player Y?
    /*  56 */ float plz; // Player Z?
    /*  60 */ float pxp; // Position X Previous
    /*  64 */ float pyp; // Position Y Previous
    /*  68 */ float pzp; // Position Z Previous
    /*  72 */ float ofx; // Offset X
    /*  76 */ float ofy; // Offset Y
    /*  80 */ float ofz; // Offset Z
    /*  84 */ int ax; // Angle X
    /*  88 */ int ay; // Angle Y
    /*  92 */ int az; // Angle Z
    /*  96 */ int axp; // Angle X Previous
    /* 100 */ int ayp; // Angle Y Previous
    /* 104 */ int azp; // Angle Z Previous
    /* 108 */ float ln; // Length
    /* 112 */ float pln; // Previous Length
    /* 116 */ float xr; // X Rotation
    /* 120 */ float xn; // X Normal
    /* 124 */ float yr; // Y Rotation
    /* 128 */ float yn; // Y Normal
    /* 132 */ int pers; // Perspective
    /* 136 */ int ppers; // Previous Perspective
    /* 140 */ int ncut; // Near Cut
    /* 144 */ int ocut; // Old Cut
    /* 148 */ unsigned int ocflg; // Occlusion Flags
    /* 152 */ unsigned int attr; // Attributes
    /* 156 */ float* mtx; // Matrix
    /* 160 */ float* mtxb; // Matrix Backup
    /* 164 */ int evc_no; // Event Camera Number
    /* 168 */ int hct; // Height Counter
    /* 172 */ int ct0; // Counter 0
    /* 176 */ int ct1; // Counter 1
    /* 180 */ int keyf_no; // Keyframe Number
    /* 184 */ float frm; // Frame
    /* 188 */ float spd; // Speed
    /* 192 */ float pxn; // Position X Next
    /* 196 */ float pyn; // Position Y Next
    /* 200 */ float pzn; // Position Z Next
    /* 204 */ int axn; // Angle X Next
    /* 208 */ int ayn; // Angle Y Next
    /* 212 */ int azn; // Angle Z Next
    /* 216 */ int pe_ax; // Previous Angle X
    /* 220 */ int pe_pers; // Previous Perspective
    /* 224 */ unsigned int fog_col; // Fog Color
    /* 228 */ float fog_nr; // Fog Near Range
    /* 232 */ float fog_fr; // Fog Far Range
    /* 236 */ float ips[20][3]; // Interpolated Position
    /* 476 */ float ian[20][3]; // Interpolated Angle
    /* 716 */ float ipf[20][3]; // Interpolated Focal Point
    /* 956 */ float icr[20][3]; // Interpolated Center
} Camera;

typedef struct Drive {
    /*  0 */ unsigned short Ready;
    /*  2 */ unsigned short IsFormat;
    /*  4 */ unsigned int LastError;
    /*  8 */ unsigned int ProgressCount;
    /* 12 */ unsigned int ProgressMax;
    /* 16 */ unsigned int Operation;
    /* 20 */ BUS_DISKINFO DiskInfo;
    /* 76 */ unsigned int Connect;
    /* 80 */ void* Work;
    /* 84 */ unsigned int WorkSize;
    /* 88 */ unsigned int Capacity;
    /* 92 */ int MemMode;
} Drive;

typedef struct Controller {
    /*  0 */ int PerType;
    /*  4 */ int OldPerType;
    /*  8 */ int PerTypeEx;
    /* 12 */ unsigned int Flag;
    /* 16 */ int SoftReset;
    /* 20 */ unsigned int on;
    /* 24 */ unsigned int press;
    /* 28 */ unsigned int Rept;
    /* 32 */ unsigned int on2;
    /* 36 */ unsigned int on2old;
    /* 40 */ unsigned int press2;
    /* 44 */ unsigned short l;
    /* 46 */ unsigned short r;
    /* 48 */ short x1;
    /* 50 */ short y1;
    /* 52 */ short x2;
    /* 54 */ short y2;
    /* 56 */ short Calibrate;
} Controller;

typedef struct ControllerButton {
    int Type;
    unsigned int Button;
} ControllerButton;

typedef struct KeyRepeatInfo {
    unsigned int WaitFlag;
    unsigned int WaitCnt;
    unsigned int Key;
} KeyRepeatInfo;

typedef struct LfOpen {
    unsigned int Flag;
    GDFS GdFs;
} LfOpen;

typedef struct Color {
    /*  0 */ float a;
    /*  4 */ float r;
    /*  8 */ float g;
    /* 12 */ float b;
} Color;

typedef struct DOOR {
    /*  0 */ unsigned int flg; // Flags
    /*  4 */ char stg_no; // Stage number
    /*  5 */ char rom_no; // Room number
    /*  6 */ unsigned char pos_no; // Position number
    /*  7 */ unsigned char dor_tp; // Door type
    /*  8 */ unsigned char mode0; // Mode 0
    /*  9 */ unsigned char mode1; // Mode 1
    /* 10 */ unsigned char mode2; // Mode 2
    /* 11 */ unsigned char mode3; // Mode 3
    /* 12 */ int ct0; // Counter 0
    /* 16 */ int ct1; // Counter 1
    /* 20 */ int ct2; // Counter 2
    /* 24 */ int ct3; // Counter 3
} DOOR;

typedef struct HardwareScreenInfo {
    /*  0 */ int mode;
    /*  4 */ int frame;
    /*  8 */ int count;
    /* 12 */ int vtx_opq_a;
    /* 16 */ int vtx_opq_b;
    /* 20 */ int vtx_trs_a;
    /* 24 */ int vtx_trs_b;
    /* 28 */ int vtx_punch;
    /* 32 */ int vtx_total;
} HardwareScreenInfo;

typedef struct Unknown18 {
    short jnt_a; // Joint A
    short jnt_b; // Joint B
    int cap_r; // Cap Radius
} Unknown18;

typedef struct Unknown16 {
    NJS_POINT3 c1;
    NJS_POINT3 c2;
    float r1;
    float r2;
} Unknown16;

typedef struct LIGHT_CLEAR_PARAMETERS {
    NJS_POINT3 ps; // Position (Start)
    float nr; // Near (Range)
    float fr; // Far (Range)
    float cr; // Clear (Red)
    float cg; // Clear (Green)
    float cb; // Clear (Blue)
} LIGHT_CLEAR_PARAMETERS;

typedef struct LIGHT_ATTRIBUTES {
    int lsrc; // Light Source
    float iamb; // Ambient Intensity
    float idif; // Diffuse Intensity
    float ispc; // Specular Intensity
    float nrang; // Near Range
    float frang; // Far Range
    void* func; // Function
    int iang; // Inner Angle
    int oang; // Outer Angle
    Color argb; // Ambient Color
} LIGHT_ATTRIBUTES;

typedef struct LIGHT_CALIBRATION {
    float ratten; // Radius Attenuation
