#define NULL 0

typedef struct Unknown24
{
	unsigned int TotalSize;
	unsigned int ClutSize;
	unsigned int ImageSize;
	unsigned short HeaderSize;
	unsigned short ClutColors;
	unsigned char PictFormat;
	unsigned char MipMapTextures;
	unsigned char ClutType;
	unsigned char ImageType;
	unsigned short ImageWidth;
	unsigned short ImageHeight;
	unsigned long GsTex0;
	unsigned long GsTex1;
	unsigned int GsRegs;
	unsigned int GsTexClut;
} Unknown24;

typedef struct MEMORYCARDPORT
{
	int lCrntType;
	int lPrevType;
	int lFreeSize;
	int lFormatType;
} MEMORYCARDPORT;


typedef struct MEMORYCARDSTATE
{
	unsigned int ulState;
	unsigned int ulError;
	unsigned int ulMcSubState;
	unsigned int ulFileSize;
	int lCurrentPort;
	int lOpenFileNumber;
	int lSelectFileNumber;
	int lOpenMode;
	unsigned short usMcSysState;
	void* vpAddr;
	char cCurrentDir[50];
	char cOpenFileName[32];
	char cRetryCount;
	char cMcCheckFlag;
	char cCheckMcFlag;
	MEMORYCARDPORT Port[2];
} MEMORYCARDSTATE;


typedef struct Unknown23
{
	float x1;
	float y1;
	float x2;
	float y2;
	float u1;
	float v1;
	float u2;
	float v2;
} Unknown23;


typedef struct Unknown22
{
	int PerType;
	int OldPerType;
	int PerTypeEx;
	unsigned int Flag;
	int SoftReset;
	unsigned int on;
	unsigned int press;
	unsigned int Rept;
	unsigned int on2;
	unsigned int on2old;
	unsigned int press2;
	unsigned short l;
	unsigned short r;
	short x1;
	short y1;
	short x2;
	short y2;
	short Calibrate;
} Unknown22;


typedef struct Vector3 {
    float x;
    float y;
    float z;
}
Vector3;


typedef struct Vector3Col {
    /*  0 */ float x;
    /*  4 */ float y;
    /*  8 */ float z;
    /* 12 */ unsigned int col;
}
Vector3Col;


typedef struct Vector5Col {
    /*  0 */ float x;
    /*  4 */ float y;
    /*  8 */ float z;
    /* 12 */ float u;
    /* 16 */ float v;
    /* 20 */ unsigned int col;
}
Vector5Col;


typedef struct Point {
    float x;
    float y;
}
Point;


typedef struct PositionVelocity {
    /*  0 */ float px;
    /*  4 */ float py;
    /*  8 */ float pz;
    /* 12 */ float vx;
    /* 16 */ float vy;
    /* 20 */ float vz;
}
PositionVelocity;


typedef struct Unknown21
{
	int PatId;
	int Mode;
	int Mode2;
	int NextMode;
	int NextReturnCode;
	int PortId;
	int OptIndex;
	int OptLevel;
	int NextOptLevel;
	int OptScrX;
	int OptScrY;
	unsigned int PalNo;
	unsigned int PalMode;
	unsigned int FontBaseColor;
	unsigned char* SysMemPtr;
	unsigned char* MsgPtr;
	unsigned char* ptr[8];
	float Timer;
	float FadeRate;
	float FadeSpeed;
	float SaverTimer;
	float SaverRate;
	float FlushCount;
	float FlushSpeed;
	float FlushCount2;
	float FlushSpeed2;
	float ScrollPlatePosX[2][2];
	char Active;
	char AppMode;
	char ExtraFlag;
	char FadeType;
	char SaverCommand;
	char Count;
	char LastLevel;
	char FromTitle;
	char CurrentDiscId;
	char NextDiscId;
	char ErrorId;
	unsigned char ErrorMsgFlushCount;
	char AnimId;
	unsigned char AnimTime;
	char GenFlag;
	char PalFlag;
	char SrFlag;
	char OptFadeType;
	char TexFlag;
	char SoundMode;
	char vibration;
	char keytype;
	char adjust_x;
	char adjust_y;
	char OptSaveFlag;
	char vMode;
	char DriveNo;
	char MsgNo;
	char DepthLevel;
	char OldVmOpMode;
	char VmOpMode;
	char SetTexture[2];
	char KeyCommandCount[7];
	char Cursor[3];
	char CursorMax[3];
	char CursorFlag[4][4];
	char ModeCommandId[4];
} Unknown21;


typedef union Unknown20 {
    unsigned int work;
    unsigned int clip;
}
Unknown20;


typedef struct VertexBuffer {
    /*  0 */ Unknown20 a;
    /*  4 */ float sx;
    /*  8 */ float sy;
    /* 12 */ float oow;
    /* 16 */ Vector3 point;
    /* 28 */ unsigned int reserve;
    /* 32 */ float u;
    /* 36 */ float v;
    /* 40 */ float inten[2];
    /* 48 */ Vector3 vector;
    /* 60 */ unsigned int flag;
}
VertexBuffer;


typedef struct Camera {
    /*   0 */ unsigned int flg;
    /*   4 */ int camver;
    /*   8 */ unsigned char mode0;
    /*   9 */ unsigned char mode1;
    /*  10 */ unsigned char mode2;
    /*  11 */ unsigned char mode3;
    /*  12 */ float px;
    /*  16 */ float py;
    /*  20 */ float pz;
    /*  24 */ float vx;
    /*  28 */ float vy;
    /*  32 */ float vz;
    /*  36 */ float wpx;
    /*  40 */ float wpy;
    /*  44 */ float wpz;
    /*  48 */ float plx;
    /*  52 */ float ply;
    /*  56 */ float plz;
    /*  60 */ float pxp;
    /*  64 */ float pyp;
    /*  68 */ float pzp;
    /*  72 */ float ofx;
    /*  76 */ float ofy;
    /*  80 */ float ofz;
    /*  84 */ int ax;
    /*  88 */ int ay;
    /*  92 */ int az;
    /*  96 */ int axp;
    /* 100 */ int ayp;
    /* 104 */ int azp;
    /* 108 */ float ln;
    /* 112 */ float pln;
    /* 116 */ float xr;
    /* 120 */ float xn;
    /* 124 */ float yr;
    /* 128 */ float yn;
    /* 132 */ int pers;
    /* 136 */ int ppers;
    /* 140 */ int ncut;
    /* 144 */ int ocut;
    /* 148 */ unsigned int ocflg;
    /* 152 */ unsigned int attr;
    /* 156 */ float* mtx;
    /* 160 */ float* mtxb;
    /* 164 */ int evc_no;
    /* 168 */ int hct;
    /* 172 */ int ct0;
    /* 176 */ int ct1;
    /* 180 */ int keyf_no;
    /* 184 */ float frm;
    /* 188 */ float spd;
    /* 192 */ float pxn;
    /* 196 */ float pyn;
    /* 200 */ float pzn;
    /* 204 */ int axn;
    /* 208 */ int ayn;
    /* 212 */ int azn;
    /* 216 */ int pe_ax;
    /* 220 */ int pe_pers;
    /* 224 */ unsigned int fog_col;
    /* 228 */ float fog_nr;
    /* 232 */ float fog_fr;
    /* 236 */ float ips[20][3];
    /* 476 */ float ian[20][3];
    /* 716 */ float ipf[20][3];
    /* 956 */ float icr[20][3];
}
Camera;


typedef struct Timestamp {
    /* 0 */ unsigned short year;
    /* 2 */ unsigned char month;
    /* 3 */ unsigned char day;
    /* 4 */ unsigned char hour;
    /* 5 */ unsigned char minute;
    /* 6 */ unsigned char second;
    /* 7 */ unsigned char dayofweek;
}
Timestamp;


typedef struct Disk {
    /*  0 */ unsigned char volume[32];
    /* 32 */ unsigned short total_blocks;
    /* 34 */ unsigned short total_user_blocks;
    /* 36 */ unsigned short free_blocks;
    /* 38 */ unsigned short free_user_blocks;
    /* 40 */ unsigned short total_exe_blocks;
    /* 42 */ unsigned short free_exe_blocks;
    /* 44 */ unsigned short block_size;
    /* 46 */ unsigned short icon_no;
    /* 48 */ Timestamp time;
}
Disk;


typedef struct Drive {
    /*  0 */ unsigned short Ready;
    /*  2 */ unsigned short IsFormat;
    /*  4 */ unsigned int LastError;
    /*  8 */ unsigned int ProgressCount;
    /* 12 */ unsigned int ProgressMax;
    /* 16 */ unsigned int Operation;
    /* 20 */ Disk DiskInfo;
    /* 76 */ unsigned int Connect;
    /* 80 */ void* Work;
    /* 84 */ unsigned int WorkSize;
    /* 88 */ unsigned int Capacity;
    /* 92 */ int MemMode;
}
Drive;


typedef struct Controller {
    /*  0 */ int PerType;
    /*  4 */ int OldPerType;
    /*  8 */ int PerTypeEx;
    /* 12 */ unsigned int Flag;
    /* 16 */ int SoftReset;
    /* 20 */ unsigned int on;
    /* 24 */ unsigned int press;
    /* 28 */ unsigned int Rept;
    /* 32 */ unsigned int on2;
    /* 36 */ unsigned int on2old;
    /* 40 */ unsigned int press2;
    /* 44 */ unsigned short l;
    /* 46 */ unsigned short r;
    /* 48 */ short x1;
    /* 50 */ short y1;
    /* 52 */ short x2;
    /* 54 */ short y2;
    /* 56 */ short Calibrate;
}
Controller;


typedef struct ControllerButton {
    int Type;
    unsigned int Button;
}
ControllerButton;


typedef struct KeyRepeatInfo {
    unsigned int WaitFlag;
    unsigned int WaitCnt;
    unsigned int Key;
}
KeyRepeatInfo;


typedef struct VibrationInfo {
    /* 0 */ unsigned char unit;
    /* 1 */ unsigned char flag;
    /* 2 */ char power;
    /* 3 */ unsigned char freq;
    /* 4 */ unsigned char inc;
    /* 5 */ unsigned char reserved[3];
}
VibrationInfo;


typedef struct GDS_DCF GDS_DCF;
typedef struct GDS_FS_LIF GDS_FS_LIF;


typedef struct GDS_FS_DIRREC_ENT {
    /*  0 */ int fad;
    /*  4 */ int fsize;
    /*  8 */ unsigned char flag;
    /*  9 */ unsigned char sid;
    /* 10 */ char fname[32];
    /* 42 */ char pad[2];
}
GDS_FS_DIRREC_ENT;


typedef struct GDS_FS_DIRINFO {
    /*  0 */ int fad;
    /*  4 */ int fsize;
    /*  8 */ unsigned char flag;
    /*  9 */ unsigned char pad[3];
}
GDS_FS_DIRINFO;


typedef struct GDS_FS_WORK GDS_FS_WORK;
typedef struct GDS_FS_HANDLE {
    /*  0 */ GDS_FS_WORK* wk;
    /*  4 */ int fid;
    /*  8 */ int fad;
    /* 12 */ int fsize;
    /* 16 */ int fsctsize;
    /* 20 */ int ofs;
    /* 24 */ int trnsed;
    /* 28 */ int rsize;
    /* 32 */ int trsize;
    /* 36 */ void(*rdendcb)(void*);
    /* 40 */ void* rdcb_1st;
    /* 44 */ void(*trendcb)(void*);
    /* 48 */ void* trcb_1st;
    /* 52 */ void(*errcb)(void*, int);
    /* 56 */ void* errcb_1st;
    /* 60 */ int gdchn;
    /* 64 */ int gdchn_wait;
    /* 68 */ int ex_errcode;
    /* 72 */ short act;
    /* 74 */ short trflag;
    /* 76 */ short used;
    /* 78 */ short tmode;
    /* 80 */ short stat;
    /* 82 */ short err;
}
GDS_FS_HANDLE;


typedef struct GDS_FS_DIRREC_TBL {
    /*  0 */ int dir_num;
    /*  4 */ int max_ent;
    /*  8 */ int dir_fad;
    /* 12 */ int pad;
    /* 16 */ GDS_FS_DIRREC_ENT dirrec_tbl[1];
}
GDS_FS_DIRREC_TBL;


typedef struct GDS_FS_WORK {
    /*    0 */ int max_open;
    /*    4 */ int pathtbl_fad;
    /*    8 */ int pathtbl_size;
    /*   12 */ GDS_DCF* dcf;
    /*   16 */ GDS_FS_DIRREC_TBL* curdir;
    /*   20 */ GDS_FS_HANDLE* syshdl;
    /*   24 */ GDS_FS_HANDLE* hndtbl;
    /*   28 */ GDS_FS_HANDLE* now_work;
    /*   32 */ int f_svr;
    /*   36 */ void(*g_errcb)(void*, int);
    /*   40 */ void* g_errcb_1st;
    /*   44 */ int gdc_ver;
    /*   48 */ int errstat;
    /*   52 */ int istray;
    /*   56 */ short f_init;
    /*   58 */ short daplayed;
    /*   60 */ GDS_FS_LIF* liftbl;
    /*   64 */ unsigned int sctbuf[1040];
    /* 4224 */ GDS_FS_HANDLE hndlist[1];
}
GDS_FS_WORK;


typedef struct LfOpen {
    unsigned int Flag;
    GDS_FS_HANDLE* GdFs;
}
LfOpen;


typedef struct TextureFileLocation {
    void* filename;
    unsigned int attr;
    unsigned int texaddr;
}
TextureFileLocation;


typedef struct TextureList {
    TextureFileLocation* textures;
    unsigned int nbTexture;
}
TextureList;


typedef struct PeripheralInfo {
    /*   0 */ unsigned int type;
    /*   4 */ unsigned int reserved[3];
    /*  16 */ unsigned char is_root;
    /*  17 */ unsigned char area_code;
    /*  18 */ unsigned char connector_dir[2];
    /*  20 */ char product_name[32];
    /*  52 */ char license[64];
    /* 116 */ unsigned short stdby_pow;
    /* 118 */ unsigned short max_pow;
}
PeripheralInfo;


typedef struct Peripheral {
    /*  0 */ unsigned int id;
    /*  4 */ unsigned int support;
    /*  8 */ unsigned int on;
    /* 12 */ unsigned int off;
    /* 16 */ unsigned int press;
    /* 20 */ unsigned int release;
    /* 24 */ unsigned short r;
    /* 26 */ unsigned short l;
    /* 28 */ short x1;
    /* 30 */ short y1;
    /* 32 */ short x2;
    /* 34 */ short y2;
    /* 36 */ char* name;
    /* 40 */ void* extend;
    /* 44 */ unsigned int old;
    /* 48 */ PeripheralInfo* info;
}
Peripheral;


typedef struct Model {
    /*  0 */ int* vlist;
    /*  4 */ short* plist;
    /*  8 */ Vector3 center;
    /* 20 */ float r;
}
Model;


typedef struct npobj npobj;
typedef struct npobj {
    /*  0 */ unsigned int evalflags;
    /*  4 */ Model* model;
    /*  8 */ float pos[3];
    /* 20 */ int ang[3];
    /* 32 */ float scl[3];
    /* 44 */ npobj* child;
    /* 48 */ npobj* sibling;
}
npobj;


typedef struct Surface {
    /*  0 */ unsigned int Type;
    /*  4 */ unsigned int BitDepth;
    /*  8 */ unsigned int PixelFormat;
    /* 12 */ unsigned int nWidth;
    /* 16 */ unsigned int nHeight;
    /* 20 */ unsigned int TextureSize;
    /* 24 */ unsigned int fSurfaceFlags;
    /* 28 */ unsigned int* pSurface;
    /* 32 */ unsigned int* pVirtual;
    /* 36 */ unsigned int* pPhysical;
}
Surface;


typedef struct TextureInfo {
    void* texaddr;
    Surface texsurface;
}
TextureInfo;


typedef struct Color {
    /*  0 */ float a;
    /*  4 */ float r;
    /*  8 */ float g;
    /* 12 */ float b;
}
Color;


typedef struct Door {
    /*  0 */ unsigned int flg;
    /*  4 */ char stg_no;
    /*  5 */ char rom_no;
    /*  6 */ unsigned char pos_no;
    /*  7 */ unsigned char dor_tp;
    /*  8 */ unsigned char mode0;
    /*  9 */ unsigned char mode1;
    /* 10 */ unsigned char mode2;
    /* 11 */ unsigned char mode3;
    /* 12 */ int ct0;
    /* 16 */ int ct1;
    /* 20 */ int ct2;
    /* 24 */ int ct3;
}
Door;


typedef struct Unknown19 {
    /*  0 */ int mode;
    /*  4 */ int frame;
    /*  8 */ int count;
    /* 12 */ int vtx_opq_a;
    /* 16 */ int vtx_opq_b;
    /* 20 */ int vtx_trs_a;
    /* 24 */ int vtx_trs_b;
    /* 28 */ int vtx_punch;
    /* 32 */ int vtx_total;
}
Unknown19;


typedef struct Unknown18 {
    short jnt_a;
    short jnt_b;
    int cap_r;
}
Unknown18;


typedef struct Unknown17 {
    Vector3 c1;
    Vector3 c2;
    float r;
}
Unknown17;


typedef struct Unknown16 {
    /*  0 */ Vector3 c1;
    /* 12 */ Vector3 c2;
    /* 24 */ float r1;
    /* 28 */ float r2;
}
Unknown16;


typedef struct Unknown15 {
    unsigned char flg;
    unsigned char type;
    unsigned char id;
    char flr_no;
    unsigned int attr;
    float px;
    float py;
    float pz;
    float w;
    float h;
    float d;
    unsigned char prm0;
    unsigned char prm1;
    unsigned char prm2;
    unsigned char prm3;
}
Unknown15;


typedef struct Unknown14 {
    Vector3 ps;
    float nr;
    float fr;
    float cr;
    float cg;
    float cb;
}
Unknown14;


typedef struct Unknown13 {
    int lsrc;
    float iamb;
    float idif;
    float ispc;
    float nrang;
    float frang;
    void* func;
    int iang;
    int oang;
    Color argb;
}
Unknown13;


typedef struct Unknown12 {
    float ratten;
    float ipd;
    float nrr;
    float frr;
    float cosi;
    float cose;
    float idev;
    float odev;
    float rate;
    float intns;
    int exp;
    int reserve;
    Vector3 lpnt;
    Vector3 lvctr;
    Vector3 lmvctr;
    Color atten;
    Color amb;
