#pragma once

#include "ps2_prefix.h"

#include "eetypes.h"
#include "eestruct.h"

#include <shinobi.h>

#define NULL 0

#define CheckCmdReq(vol, pan, pitch) (0x00 | 0 | ((vol) & 1) | (((pan) & 1) << 1) | (((pitch) & 1) << 2))

typedef struct ADV_MESSAGE_DEFINITION {
    float Sx;
    float Sy;
    int StartMsgNo;
    int NaviMsgNo;
    int MsgType;
} ADV_MESSAGE_DEFINITION;

typedef struct Unknown31 {
    float x;
    float y;
    float z;
    float w;
} Unknown31;

typedef struct SNDQUE {
    int cmd;
    char vol;
    char pan;
    short pitch;
} SNDQUE;

typedef struct Unknown29 {
    char ppStrPvpl[4];
    unsigned int ppNextTag;
    unsigned short ppCategoryCode;
    unsigned short ppBankId;
    unsigned short ppEntryOffset;
    unsigned short ppEntryCount;
} Unknown29;

typedef struct PS2_TIM_LIST_ENTRY_ADMIN {
    unsigned int gindex;
    unsigned int size;
    unsigned int count;
    void* addr;
    void* before;
    void* after;
} PS2_TIM_LIST_ENTRY_ADMIN;

typedef struct PS2_TIM_LIST_ENTRY {
    char FileId[4];
    unsigned char FormatVersion;
    unsigned char FormatId;
    unsigned short Pictures;
    unsigned int Gindex;
    unsigned char OrgColorType;
    unsigned char OrgTexType;
    unsigned short ClutChange;
    unsigned int PalNum;
    unsigned int PalData[27];
    unsigned int TotalSize; /* TIM2_PICTUREHEADER */
    unsigned int ClutSize; /* TIM2_PICTUREHEADER */
    unsigned int ImageSize; /* TIM2_PICTUREHEADER */
    unsigned short HeaderSize; /* TIM2_PICTUREHEADER */
    unsigned short ClutColors; /* TIM2_PICTUREHEADER */
    unsigned char PictFormat; /* TIM2_PICTUREHEADER */
    unsigned char MipMapTextures; /* TIM2_PICTUREHEADER */
    unsigned char ClutType; /* TIM2_PICTUREHEADER */
    unsigned char ImageType; /* TIM2_PICTUREHEADER */
    unsigned short ImageWidth; /* TIM2_PICTUREHEADER */
    unsigned short ImageHeight; /* TIM2_PICTUREHEADER */
    sceGsTex0 GsTex0; /* TIM2_PICTUREHEADER */
    sceGsTex1 GsTex1; /* TIM2_PICTUREHEADER */
    unsigned int GsRegs; /* TIM2_PICTUREHEADER */
    unsigned int GsTexClut; /* TIM2_PICTUREHEADER */
    PS2_TIM_LIST_ENTRY_ADMIN admin;
    unsigned int TpFlag;
    unsigned int ClampFlag;
} PS2_TIM_LIST_ENTRY;

typedef struct TIM2_PICTUREHEADER {
    unsigned int TotalSize;
    unsigned int ClutSize;
    unsigned int ImageSize;
    unsigned short HeaderSize;
    unsigned short ClutColors;
    unsigned char PictFormat;
    unsigned char MipMapTextures;
    unsigned char ClutType;
    unsigned char ImageType;
    unsigned short ImageWidth;
    unsigned short ImageHeight;
    unsigned long GsTex0;
    unsigned long GsTex1;
    unsigned int GsRegs;
    unsigned int GsTexClut;
} TIM2_PICTUREHEADER;

typedef struct Unknown22 {
    int PerType; // Peripheral Type
    int OldPerType; // Old Peripheral Type
    int PerTypeEx; // Peripheral Type Extended
    unsigned int Flag; // Flags
    int SoftReset; // Soft Reset
    unsigned int on; // On
    unsigned int press; // Press
    unsigned int Rept; // Repeat
    unsigned int on2; // On 2
    unsigned int on2old; // On 2 Old
    unsigned int press2; // Press 2
    unsigned short l; // Left
    unsigned short r; // Right
    short x1; // X1
    short y1; // Y1
    short x2; // X2
    short y2; // Y2
    short Calibrate; // Calibrate
} Unknown22;

typedef struct ADV_WORK {
    int PatId;
    int Mode;
    int Mode2;
    int NextMode;
    int NextReturnCode;
    int PortId;
    int OptIndex;
    int OptLevel;
    int NextOptLevel;
    int OptScrX;
    int OptScrY;
    unsigned int PalNo;
    unsigned int PalMode;
    unsigned int FontBaseColor;
    unsigned char* SysMemPtr;
    unsigned char* MsgPtr;
    unsigned char* ptr[8];
    float Timer;
    float FadeRate;
    float FadeSpeed;
    float SaverTimer;
    float SaverRate;
    float FlushCount;
    float FlushSpeed;
    float FlushCount2;
    float FlushSpeed2;
    float ScrollPlatePosX[2][2];
    char Active;
    char AppMode;
    char ExtraFlag;
    char FadeType;
    char SaverCommand;
    char Count;
    char LastLevel;
    char FromTitle;
    char CurrentDiscId;
    char NextDiscId;
    char ErrorId;
    unsigned char ErrorMsgFlushCount;
    char AnimId;
    unsigned char AnimTime;
    char GenFlag;
    char PalFlag;
    char SrFlag;
    char OptFadeType;
    char TexFlag;
    char SoundMode;
    char vibration;
    char keytype;
    char adjust_x;
    char adjust_y;
    char OptSaveFlag;
    char vMode;
    char DriveNo;
    char MsgNo;
    char DepthLevel;
    char OldVmOpMode;
    char VmOpMode;
    char SetTexture[2];
    char KeyCommandCount[7];
    char Cursor[3];
    char CursorMax[3];
    char CursorFlag[4][4];
    char ModeCommandId[4];
} ADV_WORK;

typedef struct Camera {
    /*   0 */ unsigned int flg;
    /*   4 */ int camver;
    /*   8 */ unsigned char mode0;
    /*   9 */ unsigned char mode1;
    /*  10 */ unsigned char mode2;
    /*  11 */ unsigned char mode3;
    /*  12 */ float px;
    /*  16 */ float py;
    /*  20 */ float pz;
    /*  24 */ float vx;
    /*  28 */ float vy;
    /*  32 */ float vz;
    /*  36 */ float wpx;
    /*  40 */ float wpy;
    /*  44 */ float wpz;
    /*  48 */ float plx;
    /*  52 */ float ply;
    /*  56 */ float plz;
    /*  60 */ float pxp;
    /*  64 */ float pyp;
    /*  68 */ float pzp;
    /*  72 */ float ofx;
    /*  76 */ float ofy;
    /*  80 */ float ofz;
    /*  84 */ int ax;
    /*  88 */ int ay;
    /*  92 */ int az;
    /*  96 */ int axp;
    /* 100 */ int ayp;
    /* 104 */ int azp;
    /* 108 */ float ln;
    /* 112 */ float pln;
    /* 116 */ float xr;
    /* 120 */ float xn;
    /* 124 */ float yr;
    /* 128 */ float yn;
    /* 132 */ int pers;
    /* 136 */ int ppers;
    /* 140 */ int ncut;
    /* 144 */ int ocut;
    /* 148 */ unsigned int ocflg;
    /* 152 */ unsigned int attr;
    /* 156 */ float* mtx;
    /* 160 */ float* mtxb;
    /* 164 */ int evc_no;
    /* 168 */ int hct;
    /* 172 */ int ct0;
    /* 176 */ int ct1;
    /* 180 */ int keyf_no;
    /* 184 */ float frm;
    /* 188 */ float spd;
    /* 192 */ float pxn;
    /* 196 */ float pyn;
    /* 200 */ float pzn;
    /* 204 */ int axn;
    /* 208 */ int ayn;
    /* 212 */ int azn;
    /* 216 */ int pe_ax;
    /* 220 */ int pe_pers;
    /* 224 */ unsigned int fog_col;
    /* 228 */ float fog_nr;
    /* 232 */ float fog_fr;
    /* 236 */ float ips[20][3];
    /* 476 */ float ian[20][3];
    /* 716 */ float ipf[20][3];
    /* 956 */ float icr[20][3];
} Camera;

typedef struct Drive {
    /*  0 */ unsigned short Ready;
    /*  2 */ unsigned short IsFormat;
    /*  4 */ unsigned int LastError;
    /*  8 */ unsigned int ProgressCount;
    /* 12 */ unsigned int ProgressMax;
    /* 16 */ unsigned int Operation;
    /* 20 */ BUS_DISKINFO DiskInfo;
    /* 76 */ unsigned int Connect;
    /* 80 */ void* Work;
    /* 84 */ unsigned int WorkSize;
    /* 88 */ unsigned int Capacity;
    /* 92 */ int MemMode;
} Drive;

typedef struct Controller {
    /*  0 */ int PerType;
    /*  4 */ int OldPerType;
    /*  8 */ int PerTypeEx;
    /* 12 */ unsigned int Flag;
    /* 16 */ int SoftReset;
    /* 20 */ unsigned int on;
    /* 24 */ unsigned int press;
    /* 28 */ unsigned int Rept;
    /* 32 */ unsigned int on2;
    /* 36 */ unsigned int on2old;
    /* 40 */ unsigned int press2;
    /* 44 */ unsigned short l;
    /* 46 */ unsigned short r;
    /* 48 */ short x1;
    /* 50 */ short y1;
    /* 52 */ short x2;
    /* 54 */ short y2;
    /* 56 */ short Calibrate;
} Controller;

typedef struct ControllerButton {
    int Type;
    unsigned int Button;
} ControllerButton;

typedef struct KeyRepeatInfo {
    unsigned int WaitFlag;
    unsigned int WaitCnt;
    unsigned int Key;
} KeyRepeatInfo;

typedef struct LfOpen {
    unsigned int Flag;
    GDFS GdFs;
} LfOpen;

typedef struct Color {
    /*  0 */ float a;
    /*  4 */ float r;
    /*  8 */ float g;
    /* 12 */ float b;
} Color;

typedef struct Door {
    /*  0 */ unsigned int flg; // Flags
    /*  4 */ char stg_no; // Stage number
    /*  5 */ char rom_no; // Room number
    /*  6 */ unsigned char pos_no; // Position number
    /*  7 */ unsigned char dor_tp; // Door type
    /*  8 */ unsigned char mode0; // Mode 0
    /*  9 */ unsigned char mode1; // Mode 1
    /* 10 */ unsigned char mode2; // Mode 2
    /* 11 */ unsigned char mode3; // Mode 3
    /* 12 */ int ct0; // Counter 0
    /* 16 */ int ct1; // Counter 1
    /* 20 */ int ct2; // Counter 2
    /* 24 */ int ct3; // Counter 3
} Door;

typedef struct HardwareScreenInfo {
    /*  0 */ int mode;
    /*  4 */ int frame;
    /*  8 */ int count;
    /* 12 */ int vtx_opq_a;
    /* 16 */ int vtx_opq_b;
    /* 20 */ int vtx_trs_a;
    /* 24 */ int vtx_trs_b;
    /* 28 */ int vtx_punch;
    /* 32 */ int vtx_total;
} HardwareScreenInfo;

typedef struct Unknown18 {
    short jnt_a; // Joint A
    short jnt_b; // Joint B
    int cap_r; // Cap Radius
} Unknown18;

typedef struct Unknown16 {
    NJS_POINT3 c1;
    NJS_POINT3 c2;
    float r1;
    float r2;
} Unknown16;

typedef struct Unknown15 {
    unsigned char flg; // Flags
    unsigned char type; // Type
    unsigned char id; // ID
    char flr_no; // Floor number
    unsigned int attr; // Attributes
    float px; // Position X
    float py; // Position Y
    float pz; // Position Z
    float w; // Width
    float h; // Height
    float d; // Depth
    unsigned char prm0; // Parameter 0
    unsigned char prm1; // Parameter 1
    unsigned char prm2; // Parameter 2
    unsigned char prm3; // Parameter 3
} Unknown15;

typedef struct LIGHT_CLEAR_PARAMETERS {
    NJS_POINT3 ps; // Position (Start)
    float nr; // Near (Range)
    float fr; // Far (Range)
    float cr; // Clear (Red)
    float cg; // Clear (Green)
